## Plan Result (prod-backendappgateway)




<pre><code>Plan: 0 to add, 7 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]
  * module.backendappgateway.azurerm_public_ip.app_gw[0]
  * module.backendappgateway.azurerm_public_ip.app_gw[1]
  * module.backendappgateway.azurerm_user_assigned_identity.identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw"
        name                              = "cft-aks00-prod-agw"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

        # (513 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw"
        name                              = "cft-aks01-prod-agw"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

        # (55 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[0] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-prod-pip"
        name                    = "cft-aks-appgw-prod-pip"
      ~ tags                    = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_public_ip.app_gw[1] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-appgw-prod-pip-1"
        name                    = "cft-aks-appgw-prod-pip-1"
      ~ tags                    = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.backendappgateway.azurerm_user_assigned_identity.identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "identity" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-aks-prod-agw"
        name                = "cft-aks-prod-agw"
      ~ tags                = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1388,"Program":"tfcmt","SHA1":"","Target":"prod-backendappgateway","Vars":{}} -->